1Cvgnqualitysmoke/src/DataProcessors/ЗагрузкаДополнительныхОтчетовИОбработок/ЗагрузкаДополнительныхОтчетовИОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДополнительныхОтчетовИОбработок</name>
</mdclass:DataProcessor>

1Cvgnqualitysmoke/src/Enums/ТипыИзменений/ТипыИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзменений</name>
  <enumValues>
    <name>ОбъектИзменен</name>
  </enumValues>
  <enumValues>
    <name>ОбъектПрисутствуетТолькоВОсновнойКонфигурации</name>
  </enumValues>
  <enumValues>
    <name>ОбъектПрисутствуетТолькоВКонфигурацииПоставщика</name>
  </enumValues>
</mdclass:Enum>

1Cvgnqualitysmoke/src/Catalogs/ОписаниеИзменений/ОписаниеИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОписаниеИзменений</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияИсточник</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияПриемник</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзменения</name>
    <type>
      <types>EnumRef.ТипыИзменений</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаМетаданных</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ГруппаМетаданных</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Метаданные</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКонтуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноПрограммистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноКонсультантом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПрограмист</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКонсультант</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаданныеБезПрефикса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональныйУчасток</name>
    <type>
      <types>CatalogRef.ФункциональныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВопросКонсультанту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВопросЗаказчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаДоработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоРазделениеФункциональности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статистика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОписаниеСвойств</name>
    <attributes>
      <name>СвойствоМетаданных</name>
      <type>
        <types>CatalogRef.СвойстваМетаданных</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойствМетаданных</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствМетаданных</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзменения</name>
      <type>
        <types>EnumRef.ТипыИзменений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>CatalogRef.Подсистемы</types>
        <types>CatalogRef.ОписаниеИзменений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1Cvgnqualitysmoke/src/DataProcessors/ЗагрузкаДополнительныхОтчетовИОбработок/Forms/Форма/Module.bsl
&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере(ДанныеВнешнегоОтчетаОбработки, Организация, КонфигурацияИсточник, КонфигурацияПриемник) 
	
	ТабЗначений = Новый ТаблицаЗначений;    
    
	ПоследняяСтрока = ДанныеВнешнегоОтчетаОбработки.ВысотаТаблицы;
	ПоследняяКолонка = ДанныеВнешнегоОтчетаОбработки.ШиринаТаблицы;

	ОбластьЯчеек = ДанныеВнешнегоОтчетаОбработки.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();

	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	
	Для Счетчик = 0 По ТабЗначений.Количество() - 1 Цикл
        ТекущаяСтрока = ТабЗначений[Счетчик];
 		НовСпр = Справочники.ОписаниеИзменений.СоздатьЭлемент(); 
		НовСпр.ДатаЗагрузки = ТекущаяДатаСеанса();
		НовСпр.Организация =  Организация;
		НовСпр.КонфигурацияИсточник = КонфигурацияИсточник;
		НовСпр.КонфигурацияПриемник = КонфигурацияПриемник;
		НовСпр.Наименование = ТекущаяСтрока.Вид + " " + ТекущаяСтрока.Наименование;
		НовСпр.ТипИзменения = Перечисления.ТипыИзменений.ОбъектПрисутствуетТолькоВОсновнойКонфигурации;
		НовСпр.ГруппаМетаданных = ТекущаяСтрока.Вид;
		НовСпр.Метаданные = ТекущаяСтрока.ИмяОбъекта;
		НовСпр.Описание = ТекущаяСтрока.Наименование + Символы.ПС + ТекущаяСтрока.Версия 
						+ Символы.ПС + ТекущаяСтрока.ИмяФайла + Символы.ПС + ТекущаяСтрока.Информация;
		НовСпр.Записать();
	
	КонецЦикла;
	
КонецПроцедуры 


&НаКлиенте
Процедура Загрузить(Команда)
	Если ЗначениеЗаполнено(Организация) Тогда 
		ЗагрузитьНаСервере(ДанныеВнешнегоОтчетаОбработки, Организация, КонфигурацияИсточник, КонфигурацияПриемник);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстЗапроса = "ВЫБРАТЬ
|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
|	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование,
|	ДополнительныеОтчетыИОбработки.Версия КАК Версия,
|	ДополнительныеОтчетыИОбработки.Вид КАК Вид,
|	ДополнительныеОтчетыИОбработки.ИмяОбъекта КАК ИмяОбъекта,
|	ДополнительныеОтчетыИОбработки.ИмяФайла КАК ИмяФайла,
|	ДополнительныеОтчетыИОбработки.Информация КАК Информация
|ИЗ
|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
|ГДЕ
|	НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа";
	
КонецПроцедуры
